nxp-mcuxpresso/mcux-soc-svd/MCXA185/MCXA185.xml
            </field>
          </fields>
        </register>
        <register>
          <name>BPEN1</name>
          <description>LCD Back Plane Enable register 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIN_32_BPEN</name>
              <description>LCD Pin 32 Back Plane Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_33_BPEN</name>
              <description>LCD Pin 33 Back Plane Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_34_BPEN</name>
              <description>LCD Pin 34 Back Plane Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_35_BPEN</name>
              <description>LCD Pin 35 Back Plane Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_36_BPEN</name>
              <description>LCD Pin 36 Back Plane Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_37_BPEN</name>
              <description>LCD Pin 37 Back Plane Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_38_BPEN</name>
              <description>LCD Pin 38 Back Plane Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_39_BPEN</name>
              <description>LCD Pin 39 Back Plane Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_40_BPEN</name>
              <description>LCD Pin 40 Back Plane Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_41_BPEN</name>
              <description>LCD Pin 41 Back Plane Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_42_BPEN</name>
              <description>LCD Pin 42 Back Plane Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_43_BPEN</name>
              <description>LCD Pin 43 Back Plane Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_44_BPEN</name>
              <description>LCD Pin 44 Back Plane Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_45_BPEN</name>
              <description>LCD Pin 45 Back Plane Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_46_BPEN</name>
              <description>LCD Pin 46 Back Plane Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN_47_BPEN</name>
              <description>LCD Pin 47 Back Plane Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Pin as Front Plane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP</name>
                  <description>Pin as Back Plane</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WF3_0</name>
          <description>LCD Waveform 3 to 0 Register</description>
          <alternateGroup>WF32BIT</alternateGroup>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WF0</name>
              <description>Waveform Pin 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF1</name>
              <description>Waveform Pin 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF2</name>
              <description>Waveform Pin 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF3</name>
              <description>Waveform Pin 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_0</name>
          <description>LCD Waveform 0 Register</description>
          <alternateGroup>WF8BIT</alternateGroup>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_1</name>
          <description>LCD Waveform 1 Register</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_2</name>
          <description>LCD Waveform 2 Register</description>
          <addressOffset>0x22</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_3</name>
          <description>LCD Waveform 3 Register</description>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF7_4</name>
          <description>LCD Waveform 7 to 4 Register</description>
          <alternateGroup>WF32BIT</alternateGroup>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WF4</name>
              <description>Waveform Pin 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF5</name>
              <description>Waveform Pin 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF6</name>
              <description>Waveform Pin 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF7</name>
              <description>Waveform Pin 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_4</name>
          <description>LCD Waveform 4 Register</description>
          <alternateGroup>WF8BIT</alternateGroup>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_5</name>
          <description>LCD Waveform 5 Register</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_6</name>
          <description>LCD Waveform 6 Register</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_7</name>
          <description>LCD Waveform 7 Register</description>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF11_8</name>
          <description>LCD Waveform 11 to 8 Register</description>
          <alternateGroup>WF32BIT</alternateGroup>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WF8</name>
              <description>Waveform Pin 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF9</name>
              <description>Waveform Pin 9</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF10</name>
              <description>Waveform Pin 10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WF11</name>
              <description>Waveform Pin 11</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_8</name>
          <description>LCD Waveform 8 Register</description>
          <alternateGroup>WF8BIT</alternateGroup>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_9</name>
          <description>LCD Waveform 9 Register</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_10</name>
          <description>LCD Waveform 10 Register</description>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WF8B_11</name>
          <description>LCD Waveform 11 Register</description>
          <addressOffset>0x2B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WF</name>
              <description>Pin Waveform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
